packages/collector/upload-kit/config.yml
# Standalone-collector upload kit — Taurus config for a direct-upload validation run.
# Modeled on the probe run that already succeeded on 2 Engines
# (.scratch/playwright-vitals-dashboard/probe/config.yml).
#
# concurrency 4 over 2 locations  ->  --workers 2, --repeat-each 4  (4 executions/engine, 8 total)
# Derived from the real run: --workers = concurrency / engines
#                            --repeat-each = workers * iterations
# The spec has TWO tests, so each Engine runs 2 tests x 4 repeats = 8 Executions;
# small numbers on purpose — this is a validation run, not a load test.
#
# Upload alongside: example.spec.ts, bzm-playwright-vitals.ts, playwright.config.ts, package.json

modules:
  blazemeter:
    # Must be false on accounts without provisioned dedicated IPs — true fails
    # master creation with a generic "Failed to create master".
    dedicated-ips: false

execution:
- executor: playwright
  scenario: vitals
  iterations: 2
  concurrency: 4
  locations:
      us-west-1: 1    # two locations, as in the probe — proves per-Engine artifacts
      us-west-2: 1    # and cross-Engine (repeat, worker) discrimination

scenarios:
    vitals:
        script: example.spec.ts
        browser: chromium
        # no `test:` filter — run every test in the spec